Диплом_2_часть/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланФактОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СуммаОтпусков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_2_часть/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	РассчитатьДлительностьТекущейСтроки();
	РассчитатьСуммыОтпусковПоСотрудникам();
КонецПроцедуры


&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	РассчитатьДлительностьТекущейСтроки();
	РассчитатьСуммыОтпусковПоСотрудникам();
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_СотрудникПриИзменении(Элемент)
	РассчитатьСуммыОтпусковПоСотрудникам();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммыОтпусковПоСотрудникам()
	Суммы = Новый Соответствие;
	Для Каждого Строка Из Объект.ВКМ_ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ВКМ_Сотрудник) Тогда
			Сумма = Суммы.Получить(Строка.ВКМ_Сотрудник);
			Если Сумма = Неопределено Тогда
				Сумма = 0;
			КонецЕсли;
			Суммы.Вставить(Строка.ВКМ_Сотрудник, Сумма + Строка.ВКМ_Длительность);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Строка Из Объект.ВКМ_ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ВКМ_Сотрудник) Тогда
			Строка.ВКМ_СуммаОтпусков = Суммы.Получить(Строка.ВКМ_Сотрудник);
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьТекущейСтроки()
	ТекущиеДанные = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВКМ_ДатаНачала) 
		И ЗначениеЗаполнено(ТекущиеДанные.ВКМ_ДатаОкончания) Тогда
		
		Если ТекущиеДанные.ВКМ_ДатаОкончания >= ТекущиеДанные.ВКМ_ДатаНачала Тогда
			ТекущиеДанные.ВКМ_Длительность = (НачалоДня(ТекущиеДанные.ВКМ_ДатаОкончания) - НачалоДня(ТекущиеДанные.ВКМ_ДатаНачала)) / (60 * 60 * 24) + 1;
		Иначе
			ТекущиеДанные.ВКМ_Длительность = 0;
		КонецЕсли;
	Иначе
		ТекущиеДанные.ВКМ_Длительность = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресВХранилище =ВКМ_ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура ("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры
&НаСервере
Функция ВКМ_ПоместитьВоВременноеХранилищеНаСервере()
	Адрес = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить(,"ВКМ_Сотрудник,ВКМ_ДатаНачала,ВКМ_ДатаОкончания"),);
	Возврат Адрес;
КонецФункции
#КонецОбласти
